exploded/ESP32-Rolloff/src/main.cpp
// ─────────────────────────────────────────────────────────────────────────────
//  ESP32 Rolloff Roof Alpaca Driver  (Arduino framework)
// ─────────────────────────────────────────────────────────────────────────────
//
//  ┌─────────────────────────────────────────────────────────────────────────┐
//  │  PIN CONNECTIONS  (ESP32 DevKit-C 38-pin, USB-C end at top)             │
//  │                                                                         │
//  │  LEFT SIDE  (top → bottom from USB-C)                                   │
//  │    3V3  ──────────────────── OLED VCC                                   │
//  │    GND  ──────────────────── OLED GND                                   │
//  │    D15  (GPIO15)                                                        │
//  │    D2   (GPIO2)                                                         │
//  │    D4   (GPIO4)                                                         │
//  │    RX2  (GPIO16)                                                        │
//  │    TX2  (GPIO17)                                                        │
//  │    D5   (GPIO5)                                                         │
//  │    D18  (GPIO18) ──────────── RELAY signal                              │
//  │    D19  (GPIO19) ──────────── OLED SCK  ┐ adjacent pair                │
//  │    D21  (GPIO21) ──────────── OLED SDA  ┘                              │
//  │    RX0  (GPIO3)                                                         │
//  │    TX0  (GPIO1)                                                         │
//  │    D22  (GPIO22)                                                        │
//  │    D23  (GPIO23)                                                        │
//  │    GND                                                                  │
//  │                                                                         │
//  │  RIGHT SIDE (top → bottom from USB-C)                                   │
//  │    VIN                                                                  │
//  │    GND  ──────────────────── switch common (both switches)              │
//  │    D13  (GPIO13)                                                        │
//  │    D12  (GPIO12)                                                        │
//  │    D14  (GPIO14)                                                        │
//  │    D27  (GPIO27)                                                        │
//  │    D26  (GPIO26)                                                        │
//  │    D25  (GPIO25)                                                        │
//  │    D33  (GPIO33) ──────────── Limit switch OPEN  (other terminal→GND)  │
//  │    D32  (GPIO32) ──────────── Limit switch CLOSED (other terminal→GND) │
//  │    D35  (GPIO35)                                                        │
//  │    D34  (GPIO34)                                                        │
//  │    VN   (GPIO39)                                                        │
//  │    VP   (GPIO36)                                                        │
//  │    EN                                                                   │
//  └─────────────────────────────────────────────────────────────────────────┘
//
//  Limit switches: normally-open (NO) momentary switches.
//    One terminal → ESP32 GPIO (internal pull-up enabled).
//    Other terminal → GND.
//    Switch activates (GPIO reads LOW) when roof reaches that position.
//
//  Relay: pulse HIGH for 250 ms to toggle the motor controller.
//
//  OLED: I2C 128×32 SSD1306, address 0x3C.
//    SCK/SCL → GPIO19,  SDA → GPIO21  (adjacent pins on the board).
//
//  Web servers:
//    Port  80  — status/control page for browser
//    Port 11111 — ASCOM Alpaca API (dome) + management + setup
//    UDP  32227 — Alpaca discovery
// ─────────────────────────────────────────────────────────────────────────────

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <WiFiUDP.h>
#include <Wire.h>
#include <time.h>
#include <esp_task_wdt.h>
#include <esp_system.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include "wifi_credentials.h"

// ── Pin definitions ───────────────────────────────────────────────────────────
#define LIMIT_SWITCH_CLOSED  32   // INPUT_PULLUP, active LOW
#define LIMIT_SWITCH_OPEN    33   // INPUT_PULLUP, active LOW
#define RELAY_PIN            18   // OUTPUT, pulse HIGH for RELAY_PULSE_MS

#define OLED_SDA             21   // I2C data  (adjacent pair on left rail)
#define OLED_SCL             19   // I2C clock (adjacent pair on left rail)

// ── OLED ──────────────────────────────────────────────────────────────────────
#define SCREEN_WIDTH   128
#define SCREEN_HEIGHT   32
#define OLED_RESET      -1
#define OLED_I2C_ADDR   0x3C

// ── Timing ────────────────────────────────────────────────────────────────────
#define RELAY_PULSE_MS       250
#define MOVEMENT_TIMEOUT_MS  (120UL * 1000UL)
#define OLED_REFRESH_MS      500

// ── OLED burn-in mitigation ───────────────────────────────────────────────────
// This display runs static 24/7, which is exactly how SSD1306 panels develop
// permanently dim patches.  Three defences:
//   1. Lower drive current — the Adafruit default (0xCF) is far brighter than
//      needed indoors and burns in proportionally faster.
//   2. Nudge the whole layout by a few pixels periodically, so no pixel is lit
//      continuously.  The layout leaves 1 px of vertical slack for this.
//   3. Blank the panel entirely once idle; any state change wakes it.
#define OLED_CONTRAST          0x30      // 0x00-0xFF, was 0xCF
#define OLED_SHIFT_INTERVAL_MS (60UL * 1000UL)
#define OLED_IDLE_BLANK_MS     (30UL * 60UL * 1000UL)   // 0 disables blanking

// ── Watchdogs ─────────────────────────────────────────────────────────────────
// 1. Hardware task watchdog — reboots if loop() stops running (hung handler,
//    deadlock, crashed network stack).  Fed once per loop() iteration.
// 2. WiFi supervisor — polls the link, re-associates, and finally reboots if
//    the association can't be recovered.  This is the case that left the OLED
//    showing "Connecting..." until it was power cycled.
#define WDT_TIMEOUT_S             30
#define WIFI_CHECK_INTERVAL_MS    5000UL   // how often to poll link state
#define WIFI_RECONNECT_WAIT_MS   15000UL   // grace period per reconnect attempt
#define WIFI_MAX_RECONNECT_TRIES  4        // ~60 s down, then reboot
#define BOOT_WIFI_REBEGIN_TRIES   30       // 30 × 500 ms = 15 s, then re-begin
#define BOOT_WIFI_MAX_TRIES       60       // 60 × 500 ms = 30 s, then reboot

// ── Time (house convention: Melbourne, DST handled by configTzTime) ───────────
static const char *TZ_INFO      = "AEST-10AEDT,M10.1.0/2,M4.1.0/3";
static const char *NTP_SERVER_1 = "pool.ntp.org";
static const char *NTP_SERVER_2 = "time.nist.gov";
#define TIME_SYNCED_EPOCH  1704067200UL   // 2024-01-01; anything below = not synced

// ── Ports ─────────────────────────────────────────────────────────────────────
#define INFO_PORT              80
#define ALPACA_HTTP_PORT    11111
#define ALPACA_DISCOVERY_PORT 32227

// ── Globals ───────────────────────────────────────────────────────────────────
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

WebServer infoServer(INFO_PORT);
WebServer alpacaServer(ALPACA_HTTP_PORT);
WiFiUDP   udpDiscovery;

bool s_oledOk = false;

