exploded/ESP32-Rolloff/src/main.cpp
// ── State ─────────────────────────────────────────────────────────────────────
enum ShutterStatus {
    SHUTTER_OPEN    = 0,
    SHUTTER_CLOSED  = 1,
    SHUTTER_OPENING = 2,
    SHUTTER_CLOSING = 3,
    SHUTTER_ERROR   = 4
};
enum MotionState { MOTION_NONE = 0, MOTION_OPENING, MOTION_CLOSING, MOTION_ERROR };
enum LastCommand  { LAST_CMD_NONE = 0, LAST_CMD_OPEN, LAST_CMD_CLOSE };

MotionState   s_motionState     = MOTION_NONE;
unsigned long s_motionStartMs   = 0;
LastCommand   s_lastCommand     = LAST_CMD_NONE;
bool          s_alpacaConnected = true;
uint32_t      s_serverTxId      = 1;

bool          s_relayActive   = false;
unsigned long s_relayStartMs  = 0;
unsigned long s_lastOledMs    = 0;

// WiFi supervisor state
unsigned long s_lastWifiCheckMs = 0;
unsigned long s_wifiDownSinceMs = 0;   // 0 = link is up
uint8_t       s_wifiRetries     = 0;
uint32_t      s_wifiDropCount   = 0;   // reported on the info page

// ── Diagnostics ───────────────────────────────────────────────────────────────
// Lives in RTC memory, which survives a software reset and a watchdog reset but
// not a power cycle.  That's exactly what we want: if the device reboots itself
// overnight the evidence is still there in the morning.  A power cycle
// deliberately clears it, so the counters always mean "since mains was applied".
#define DIAG_MAGIC   0x524F4C46UL   // "ROLF"
#define DIAG_EVENTS  12

enum DiagEvent : uint8_t {
    EV_NONE = 0, EV_BOOT, EV_WIFI_LOST, EV_WIFI_OK, EV_REBOOT, EV_OPEN, EV_CLOSE
};

struct DiagEntry {
    uint32_t epoch;      // 0 if the clock wasn't synced yet
    uint32_t uptimeSec;
    uint8_t  type;
};

struct DiagRecord {
    uint32_t  magic;
    uint32_t  bootCount;
    uint32_t  wifiDrops;   // cumulative across reboots, unlike s_wifiDropCount
    uint8_t   head;
    DiagEntry ev[DIAG_EVENTS];
};

RTC_NOINIT_ATTR DiagRecord s_diag;

const char *diagEventName(uint8_t t)
{
    switch (t) {
        case EV_BOOT:      return "boot";
        case EV_WIFI_LOST: return "WiFi lost";
        case EV_WIFI_OK:   return "WiFi recovered";
        case EV_REBOOT:    return "self-reboot";
        case EV_OPEN:      return "open cmd";
        case EV_CLOSE:     return "close cmd";
        default:           return "";
    }
}

const char *resetReasonName()
{
    switch (esp_reset_reason()) {
        case ESP_RST_POWERON:  return "power-on";
        case ESP_RST_SW:       return "software restart";
        case ESP_RST_PANIC:    return "panic / exception";
        case ESP_RST_TASK_WDT: return "TASK WATCHDOG";
        case ESP_RST_INT_WDT:  return "interrupt watchdog";
        case ESP_RST_WDT:      return "other watchdog";
        case ESP_RST_BROWNOUT: return "BROWNOUT (power dip)";
        case ESP_RST_EXT:      return "external reset pin";
        case ESP_RST_DEEPSLEEP:return "deep sleep wake";
        default:               return "unknown";
    }
}

void diagLog(DiagEvent type)
{
    DiagEntry &e = s_diag.ev[s_diag.head];
    time_t now   = time(nullptr);
    e.epoch      = (now > (time_t)TIME_SYNCED_EPOCH) ? (uint32_t)now : 0;
    e.uptimeSec  = millis() / 1000UL;
    e.type       = (uint8_t)type;
    s_diag.head  = (s_diag.head + 1) % DIAG_EVENTS;
}

// Local wall-clock string, or an uptime fallback when NTP hadn't synced yet.
String diagWhen(const DiagEntry &e)
{
    if (e.epoch == 0) return "+" + String(e.uptimeSec) + "s (no clock)";
    time_t t = (time_t)e.epoch;
    struct tm tmv;
    localtime_r(&t, &tmv);
    char buf[24];
    strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &tmv);
    return String(buf);
}

// Diagnostics card for the info page — newest event first.
String diagCardHtml()
{
    String h = "<div class='card'><h2>Diagnostics</h2>"
               "<p><strong>Last reset:</strong> " + String(resetReasonName()) + "</p>"
               "<p><strong>Boots since power-on:</strong> " + String(s_diag.bootCount) + "</p>"
               "<p><strong>WiFi drops since power-on:</strong> " + String(s_diag.wifiDrops) + "</p>";

    time_t now = time(nullptr);
    h += "<p><strong>Clock:</strong> ";
    if (now > (time_t)TIME_SYNCED_EPOCH) {
        struct tm tmv;
        localtime_r(&now, &tmv);
        char buf[24];
        strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &tmv);
        h += buf;
    } else {
        h += "not synced";
    }
    h += "</p>";

    h += "<table><tr><th align='left'>When</th><th align='left'>Event</th></tr>";
    bool any = false;
    for (int i = 0; i < DIAG_EVENTS; i++) {
        // walk backwards from the most recently written slot
        int idx = (s_diag.head - 1 - i + 2 * DIAG_EVENTS) % DIAG_EVENTS;
        const DiagEntry &e = s_diag.ev[idx];
        if (e.type == EV_NONE) continue;
        any = true;
        h += "<tr><td><code>" + diagWhen(e) + "</code></td><td>"
             + String(diagEventName(e.type)) + "</td></tr>";
    }
    if (!any) h += "<tr><td colspan='2'>no events recorded</td></tr>";
    h += "</table></div>";
    return h;
}

// OLED burn-in state
unsigned long s_oledActivityMs = 0;    // last time something worth showing happened
unsigned long s_lastShiftMs    = 0;
uint8_t       s_oledShift      = 0;    // bit0 = y offset, bits1-2 = x offset
bool          s_oledBlanked    = false;

// Anything the operator would want to see on the panel calls this.
void oledWake()
{
    s_oledActivityMs = millis();
}

// ── Shutter logic ─────────────────────────────────────────────────────────────
ShutterStatus getShutterStatus()
{
    bool closedActive = (digitalRead(LIMIT_SWITCH_CLOSED) == LOW);
    bool openActive   = (digitalRead(LIMIT_SWITCH_OPEN)   == LOW);

    if (closedActive && openActive) {
        s_motionState = MOTION_ERROR;
        s_lastCommand = LAST_CMD_NONE;
        return SHUTTER_ERROR;
    }
    if (closedActive) {
        s_motionState = MOTION_NONE;
        if (s_lastCommand == LAST_CMD_CLOSE) s_lastCommand = LAST_CMD_NONE;
        return SHUTTER_CLOSED;
    }
    if (openActive) {
        if (s_motionState == MOTION_CLOSING) return SHUTTER_CLOSING;
        s_motionState = MOTION_NONE;
        if (s_lastCommand == LAST_CMD_OPEN) s_lastCommand = LAST_CMD_NONE;
        return SHUTTER_OPEN;
    }

