exploded/ESP32-Rolloff/src/main.cpp
    if (s_motionState == MOTION_OPENING) return SHUTTER_OPENING;
    if (s_motionState == MOTION_CLOSING) return SHUTTER_CLOSING;
    if (s_motionState == MOTION_ERROR)   return SHUTTER_ERROR;
    if (s_lastCommand == LAST_CMD_OPEN)  return SHUTTER_OPENING;
    if (s_lastCommand == LAST_CMD_CLOSE) return SHUTTER_CLOSING;
    return SHUTTER_ERROR;
}

bool isSlewing()
{
    ShutterStatus s = getShutterStatus();
    return s == SHUTTER_OPENING || s == SHUTTER_CLOSING;
}

void triggerRelayPulse()
{
    digitalWrite(RELAY_PIN, HIGH);
    s_relayActive  = true;
    s_relayStartMs = millis();
    oledWake();
}

const char* shutterLabel(ShutterStatus s)
{
    switch (s) {
        case SHUTTER_OPEN:    return "OPEN";
        case SHUTTER_CLOSED:  return "CLOSED";
        case SHUTTER_OPENING: return "OPENING";
        case SHUTTER_CLOSING: return "CLOSING";
        default:              return "ERROR";
    }
}

// ── OLED ──────────────────────────────────────────────────────────────────────
// Layout (128x32 pixels, font size 1 = 6x8 px per character), all offset by
// (dx, dy) so the image drifts slightly over time:
//   y= 0: "Rolloff Roof"
//   y=11: status word inside an outlined box
//   y=23: IP address (or link-down countdown)
// The status box is an outline rather than a filled bar: the old
// fillRect(0,11,128,9) lit 1152 pixels continuously, which is both the main
// burn-in source and a heavy enough load to sag the charge pump.
void updateOLED()
{
    if (!s_oledOk) return;

    // Blank the panel once nothing has happened for a while.
    if (OLED_IDLE_BLANK_MS && (millis() - s_oledActivityMs) > OLED_IDLE_BLANK_MS) {
        if (!s_oledBlanked) {
            display.clearDisplay();
            display.display();
            display.ssd1306_command(SSD1306_DISPLAYOFF);
            s_oledBlanked = true;
        }
        return;
    }
    if (s_oledBlanked) {
        display.ssd1306_command(SSD1306_DISPLAYON);
        s_oledBlanked = false;
    }

    const int16_t dx = (s_oledShift >> 1) & 0x03;   // 0-3 px
    const int16_t dy =  s_oledShift       & 0x01;   // 0-1 px

    display.clearDisplay();
    display.setTextColor(SSD1306_WHITE);
    display.setTextSize(1);

    // Row 1 — title
    display.setCursor(dx, dy);
    display.print("Rolloff Roof");

    // Row 2 — status word in an outlined box
    ShutterStatus status = getShutterStatus();
    const char *label = shutterLabel(status);
    int16_t boxW = (int16_t)strlen(label) * 6 + 5;
    display.drawRect(dx, 11 + dy, boxW, 11, SSD1306_WHITE);
    display.setCursor(dx + 3, 13 + dy);
    display.print(label);

    // Row 3 — IP address, or how long the link has been down
    display.setCursor(dx, 23 + dy);
    if (WiFi.status() == WL_CONNECTED) {
        display.print(WiFi.localIP().toString());
    } else if (s_wifiDownSinceMs != 0) {
        display.printf("WiFi lost %lus", (millis() - s_wifiDownSinceMs) / 1000UL);
    } else {
        display.print("Connecting...");
    }

    display.display();
}

// ── Watchdog / recovery ───────────────────────────────────────────────────────
// Reboot, but never while the roof is physically moving — a reset floats the
// relay pin briefly, and we don't want to glitch the motor controller mid-travel.
// Returns having done nothing if motion is in progress; the caller retries.
void safeRestart(const char *reason)
{
    if (s_motionState == MOTION_OPENING || s_motionState == MOTION_CLOSING) {
        Serial.printf("Restart requested (%s) — deferred, roof is moving\n", reason);
        return;
    }

    Serial.printf("Restarting: %s\n", reason);
    diagLog(EV_REBOOT);
    if (s_oledOk) {
        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(0, 0);
        display.print("Restarting");
        display.setCursor(0, 12);
        display.print(reason);
        display.display();
    }
    Serial.flush();
    delay(1000);
    ESP.restart();
}

// Polled from loop().  Escalates: notice the drop → re-associate → reboot.
void maintainWifi()
{
    if (millis() - s_lastWifiCheckMs < WIFI_CHECK_INTERVAL_MS) return;
    s_lastWifiCheckMs = millis();

    if (WiFi.status() == WL_CONNECTED) {
        if (s_wifiDownSinceMs != 0) {
            Serial.print("WiFi recovered, IP: ");
            Serial.println(WiFi.localIP());
            diagLog(EV_WIFI_OK);
            oledWake();
        }
        s_wifiDownSinceMs = 0;
        s_wifiRetries     = 0;
        return;
    }

    // First time we've seen the link down — kick off a reconnect immediately.
    if (s_wifiDownSinceMs == 0) {
        s_wifiDownSinceMs = millis();
        s_wifiRetries     = 0;
        s_wifiDropCount++;
        s_diag.wifiDrops++;
        Serial.println("WiFi link lost — reconnecting");
        diagLog(EV_WIFI_LOST);
        oledWake();   // a drop is worth lighting the panel for
        WiFi.disconnect();
        WiFi.begin(WIFI_SSID, WIFI_PASS);
        return;
    }

    // Give the current attempt its full grace period before doing anything else.
    if (millis() - s_wifiDownSinceMs < WIFI_RECONNECT_WAIT_MS) return;

    if (s_wifiRetries >= WIFI_MAX_RECONNECT_TRIES) {
        safeRestart("WiFi down");
        return;   // only returns here if the roof is moving — retry next poll
    }

    s_wifiRetries++;
    Serial.printf("WiFi reconnect attempt %u/%u\n", s_wifiRetries, WIFI_MAX_RECONNECT_TRIES);
    WiFi.disconnect();
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    s_wifiDownSinceMs = millis();
}

// ── Alpaca response helpers ───────────────────────────────────────────────────
void addCorsHeaders(WebServer &srv)
{
    srv.sendHeader("Access-Control-Allow-Origin",  "*");
    srv.sendHeader("Access-Control-Allow-Methods", "GET, PUT, OPTIONS");
    srv.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

void sendAlpacaRaw(WebServer &srv, const String &valueJson,
                   uint32_t clientTx, uint32_t errorNum, const String &errorMsg)
{
    uint32_t serverTx = s_serverTxId++;
    String resp =
        "{\"ClientTransactionID\":" + String(clientTx) +
        ",\"ServerTransactionID\":"  + String(serverTx) +
        ",\"ErrorNumber\":"          + String(errorNum) +
        ",\"ErrorMessage\":\""       + errorMsg + "\"," + valueJson + "}";
    addCorsHeaders(srv);
    srv.send(200, "application/json", resp);
}

void sendAlpacaBool(WebServer &srv, bool v, uint32_t clientTx)
{
    sendAlpacaRaw(srv, String("\"Value\":") + (v ? "true" : "false"), clientTx, 0, "");
}

void sendAlpacaInt(WebServer &srv, int v, uint32_t clientTx)
{
    sendAlpacaRaw(srv, "\"Value\":" + String(v), clientTx, 0, "");
}

void sendAlpacaString(WebServer &srv, const String &v, uint32_t clientTx)
{
    sendAlpacaRaw(srv, "\"Value\":\"" + v + "\"", clientTx, 0, "");
}

