exploded/ESP32-Rolloff/src/main.cpp
void sendAlpacaArray(WebServer &srv, const String &json, uint32_t clientTx)
{
    sendAlpacaRaw(srv, "\"Value\":" + json, clientTx, 0, "");
}

void sendAlpacaError(WebServer &srv, uint32_t clientTx, uint32_t errNum, const String &msg)
{
    sendAlpacaRaw(srv, "\"Value\":null", clientTx, errNum, msg);
}

uint32_t alpacaClientTx()
{
    String v = alpacaServer.arg("ClientTransactionID");
    return v.length() ? (uint32_t)v.toInt() : 0;
}

// ── Dome GET ──────────────────────────────────────────────────────────────────
void handleDomeGet()
{
    uint32_t clientTx = alpacaClientTx();
    String ep = alpacaServer.uri().substring(String("/api/v1/dome/0/").length());

    if (ep == "connected")        return sendAlpacaBool  (alpacaServer, s_alpacaConnected, clientTx);
    if (ep == "description")      return sendAlpacaString(alpacaServer, "Rolloff roof Alpaca dome driver", clientTx);
    if (ep == "driverinfo")       return sendAlpacaString(alpacaServer, "ESP32 Alpaca Dome Driver", clientTx);
    if (ep == "driverversion")    return sendAlpacaString(alpacaServer, "1.0", clientTx);
    if (ep == "interfaceversion") return sendAlpacaInt   (alpacaServer, 3, clientTx);
    if (ep == "name")             return sendAlpacaString(alpacaServer, "Rolloff Roof", clientTx);
    if (ep == "supportedactions") return sendAlpacaArray (alpacaServer, "[]", clientTx);

    if (ep == "cansetshutter")    return sendAlpacaBool(alpacaServer, true,  clientTx);
    if (ep == "canfindhome")      return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "canpark")          return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansetaltitude")   return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansetazimuth")    return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansetpark")       return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "canslave")         return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansyncazimuth")   return sendAlpacaBool(alpacaServer, false, clientTx);

    if (ep == "shutterstatus")    return sendAlpacaInt (alpacaServer, (int)getShutterStatus(), clientTx);
    if (ep == "slewing")          return sendAlpacaBool(alpacaServer, isSlewing(), clientTx);
    if (ep == "slaved")           return sendAlpacaBool(alpacaServer, false, clientTx);

    if (ep == "athome" || ep == "atpark")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "PropertyNotImplementedException");
    if (ep == "azimuth" || ep == "altitude")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "PropertyNotImplementedException");

    sendAlpacaError(alpacaServer, clientTx, 0x401, "InvalidValueException");
}

// ── Dome PUT ──────────────────────────────────────────────────────────────────
void handleDomePut()
{
    uint32_t clientTx = alpacaClientTx();
    String ep = alpacaServer.uri().substring(String("/api/v1/dome/0/").length());

    if (ep == "connected") {
        String val = alpacaServer.arg("Connected");
        if (val == "true"  || val == "True"  || val == "1") s_alpacaConnected = true;
        if (val == "false" || val == "False" || val == "0") s_alpacaConnected = false;
        return sendAlpacaBool(alpacaServer, s_alpacaConnected, clientTx);
    }
    if (ep == "openshutter") {
        if (getShutterStatus() != SHUTTER_OPEN) {
            s_lastCommand   = LAST_CMD_OPEN;
            s_motionState   = MOTION_OPENING;
            s_motionStartMs = millis();
            diagLog(EV_OPEN);
            triggerRelayPulse();
        }
        return sendAlpacaRaw(alpacaServer, "\"Value\":null", clientTx, 0, "");
    }
    if (ep == "closeshutter") {
        if (getShutterStatus() != SHUTTER_CLOSED) {
            s_lastCommand   = LAST_CMD_CLOSE;
            s_motionState   = MOTION_CLOSING;
            s_motionStartMs = millis();
            diagLog(EV_CLOSE);
            triggerRelayPulse();
        }
        return sendAlpacaRaw(alpacaServer, "\"Value\":null", clientTx, 0, "");
    }
    if (ep == "abortslew") {
        triggerRelayPulse();
        s_motionState = MOTION_ERROR;
        return sendAlpacaRaw(alpacaServer, "\"Value\":null", clientTx, 0, "");
    }

    if (ep == "action"        || ep == "commandblind" ||
        ep == "commandbool"   || ep == "commandstring")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "MethodNotImplementedException");

    if (ep == "findhome"       || ep == "park"             || ep == "setpark"  ||
        ep == "slewtoaltitude" || ep == "slewtoazimuth"    || ep == "synctoazimuth" ||
        ep == "slaved")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "MethodNotImplementedException");

    sendAlpacaError(alpacaServer, clientTx, 0x401, "InvalidValueException");
}

// ── Management ────────────────────────────────────────────────────────────────
void handleManagement()
{
    uint32_t clientTx = alpacaClientTx();
    String path = alpacaServer.uri();

    if (path == "/management/apiversions")
        return sendAlpacaArray(alpacaServer, "[1]", clientTx);

    if (path == "/management/v1/description") {
        String desc =
            "{\"ServerName\":\"ESP32 Alpaca\",\"Manufacturer\":\"Rolloff\","
            "\"ManufacturerVersion\":\"1.0\",\"Location\":\"Observatory\"}";
        return sendAlpacaRaw(alpacaServer, "\"Value\":" + desc, clientTx, 0, "");
    }
    if (path == "/management/v1/configureddevices") {
        String devices =
            "[{\"DeviceType\":\"Dome\",\"DeviceName\":\"Rolloff Roof\","
            "\"DeviceNumber\":0,\"UniqueID\":\"ESP32-ROLLOFF-0\"}]";
        return sendAlpacaArray(alpacaServer, devices, clientTx);
    }

    addCorsHeaders(alpacaServer);
    alpacaServer.send(404, "text/plain", "Not found");
}

// ── Alpaca dome route handler (GET + PUT + OPTIONS) ──────────────────────────
// Registered explicitly for every /api/v1/dome/0/* path so WebServer always
// has a non-null _currentHandler and the "request handler not found" log_e
// warning is never triggered.
void handleDomeAny()
{
    HTTPMethod m = alpacaServer.method();
    if (m == HTTP_OPTIONS) { addCorsHeaders(alpacaServer); alpacaServer.send(200); return; }
    if (m == HTTP_GET)     { handleDomeGet(); return; }
    if (m == HTTP_PUT)     { handleDomePut(); return; }
    alpacaServer.send(405, "text/plain", "Method Not Allowed");
}

// ── Info page (port 80) ───────────────────────────────────────────────────────
// The Open/Close buttons use window.location.hostname to build the URL so no
// IP is hardcoded.  The PUT goes cross-origin to port 11111; CORS is enabled
// on the Alpaca server so the browser preflight succeeds.
void handleInfoRoot()
{
    oledWake();   // someone is looking at the device

    bool closedActive = (digitalRead(LIMIT_SWITCH_CLOSED) == LOW);
    bool openActive   = (digitalRead(LIMIT_SWITCH_OPEN)   == LOW);
    ShutterStatus status = getShutterStatus();

