exploded/ESP32-Rolloff/src/main.cpp
    String closedColor = closedActive ? "#dc3545" : "#28a745";
    String openColor   = openActive   ? "#dc3545" : "#28a745";

    String html =
        "<html><head>"
        "<meta http-equiv='refresh' content='3'>"
        "<style>"
        "body{font-family:Arial,sans-serif;margin:40px;background:#f5f5f5}"
        "h1{color:#333}"
        ".card{padding:16px;margin:12px 0;border-radius:8px;background:#fff;"
              "box-shadow:0 2px 6px rgba(0,0,0,.1)}"
        ".btn{padding:10px 16px;margin-right:8px;border:none;border-radius:6px;"
             "cursor:pointer;font-size:1em}"
        ".open{background:#28a745;color:#fff}"
        ".close{background:#dc3545;color:#fff}"
        "table{border-collapse:collapse;width:100%}"
        "th,td{padding:4px 8px;border-bottom:1px solid #eee;font-size:.9em}"
        "</style>"
        "</head><body>"
        "<h1>Rolloff Roof Controller</h1>"
        "<div class='card'>"
        "<h2>Status</h2>"
        "<p><strong>Shutter:</strong> " + String(shutterLabel(status)) + "</p>"
        "<p><strong>Alpaca Connected:</strong> " + (s_alpacaConnected ? "Yes" : "No") + "</p>"
        "<p><strong>Closed switch (GPIO 32):</strong> "
            "<span style='color:" + closedColor + ";'>"
            + (closedActive ? "ACTIVE" : "inactive") + "</span></p>"
        "<p><strong>Open switch (GPIO 33):</strong> "
            "<span style='color:" + openColor + ";'>"
            + (openActive ? "ACTIVE" : "inactive") + "</span></p>"
        "</div>"
        "<div class='card'>"
        "<h2>Link</h2>"
        "<p><strong>Uptime:</strong> " + String(millis() / 60000UL) + " min</p>"
        "<p><strong>WiFi RSSI:</strong> " + String(WiFi.RSSI()) + " dBm</p>"
        "<p><strong>WiFi drops since boot:</strong> " + String(s_wifiDropCount) + "</p>"
        "<p><strong>Free heap:</strong> " + String(ESP.getFreeHeap()) + " bytes</p>"
        "</div>"
        + diagCardHtml() +
        "<div class='card'>"
        "<h2>Controls</h2>"
        "<button class='btn open'  onclick='sendCmd(\"openshutter\")'>Open Roof</button>"
        "<button class='btn close' onclick='sendCmd(\"closeshutter\")'>Close Roof</button>"
        "</div>"
        "<div class='card'>"
        "<h2>Alpaca</h2>"
        "<p>API base: <code>http://&lt;IP&gt;:" + String(ALPACA_HTTP_PORT) + "/api/v1/dome/0/</code></p>"
        "<p>Discovery UDP port: " + String(ALPACA_DISCOVERY_PORT) + "</p>"
        "</div>"
        "<script>"
        "function sendCmd(cmd){"
          "var url='http://'+window.location.hostname+':" + String(ALPACA_HTTP_PORT) + "/api/v1/dome/0/'+cmd;"
          "fetch(url,{method:'PUT',"
            "headers:{'Content-Type':'application/x-www-form-urlencoded'},"
            "body:'ClientID=1&ClientTransactionID='+Date.now()})"
          ".then(()=>location.reload())"
          ".catch(e=>alert('Error: '+e));"
        "}"
        "</script>"
        "</body></html>";

    infoServer.send(200, "text/html", html);
}

// ── Alpaca UDP discovery ──────────────────────────────────────────────────────
void handleDiscovery()
{
    int pktLen = udpDiscovery.parsePacket();
    if (pktLen <= 0) return;

    char buf[64];
    int n = udpDiscovery.read(buf, sizeof(buf) - 1);
    if (n <= 0) return;
    buf[n] = '\0';

    if (strncmp(buf, "alpacadiscovery1", 16) == 0) {
        char resp[64];
        snprintf(resp, sizeof(resp), "{\"AlpacaPort\":%d}", ALPACA_HTTP_PORT);
        udpDiscovery.beginPacket(udpDiscovery.remoteIP(), udpDiscovery.remotePort());
        udpDiscovery.print(resp);
        udpDiscovery.endPacket();
    }
}

// ── setup() ───────────────────────────────────────────────────────────────────
void setup()
{
    Serial.begin(115200);
    Serial.println("\n\nESP32 Rolloff Alpaca Driver starting...");

    // Diagnostics record — RTC memory is garbage after a power cycle, so gate on
    // both the magic and the reset reason before trusting it.
    esp_reset_reason_t rr = esp_reset_reason();
    if (s_diag.magic != DIAG_MAGIC || rr == ESP_RST_POWERON) {
        memset(&s_diag, 0, sizeof(s_diag));
        s_diag.magic = DIAG_MAGIC;
    }
    s_diag.bootCount++;
    Serial.printf("Reset reason: %s (boot #%lu)\n", resetReasonName(),
                  (unsigned long)s_diag.bootCount);

    // GPIO
    pinMode(LIMIT_SWITCH_CLOSED, INPUT_PULLUP);
    pinMode(LIMIT_SWITCH_OPEN,   INPUT_PULLUP);
    pinMode(RELAY_PIN, OUTPUT);
    digitalWrite(RELAY_PIN, LOW);   // relay off at boot

    Serial.printf("Limit switches: GPIO%d (closed), GPIO%d (open)\n",
                  LIMIT_SWITCH_CLOSED, LIMIT_SWITCH_OPEN);
    Serial.printf("Relay: GPIO%d\n", RELAY_PIN);

    // OLED (I2C on GPIO19=SCL, GPIO21=SDA)
    Wire.begin(OLED_SDA, OLED_SCL);

    // Scan I2C bus to find the OLED address.
    // Note: Adafruit SSD1306 begin() returns true even when no device is present
    // (it only checks RAM allocation), so we use the scan as the real indicator.
    Serial.print("I2C scan: ");
    uint8_t oledAddr = 0;
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire.beginTransmission(addr);
        if (Wire.endTransmission() == 0) {
            Serial.printf("0x%02X ", addr);
            if ((addr == 0x3C || addr == 0x3D) && oledAddr == 0) oledAddr = addr;
        }
    }
    Serial.println(oledAddr ? "" : "no devices found — check SDA→D21 SCL→D19 wiring");

    // Only initialise the display if a known SSD1306 address was actually found
    if (oledAddr) {
        s_oledOk = display.begin(SSD1306_SWITCHCAPVCC, oledAddr);
    }
    if (s_oledOk) {
        // Turn the drive current down before anything is shown — the library
        // default (0xCF) is needlessly bright and accelerates burn-in.
        display.ssd1306_command(SSD1306_SETCONTRAST);
        display.ssd1306_command(OLED_CONTRAST);

        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(0, 0);
        display.print("Rolloff Roof");
        display.setCursor(0, 12);
        display.print("Connecting...");
        display.display();
        Serial.println("OLED OK");
    } else {
        Serial.println("OLED init failed - continuing without display");
    }

    // WiFi — re-begin at 15 s, restart at 30 s
    WiFi.persistent(false);        // don't wear out flash rewriting the same creds
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);          // modem sleep makes the link flaky under polling
    WiFi.setAutoReconnect(true);   // first line of defence; maintainWifi() backs it up
    WiFi.setHostname("rolloff");
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("Connecting to WiFi");
    {
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED) {
            delay(500);
            Serial.print(".");
            ++attempts;

            // Half way — tear the association down and start over.  Cheaper than
            // a reboot and clears a stuck WPA handshake.
            if (attempts == BOOT_WIFI_REBEGIN_TRIES) {
                Serial.print(" retrying");
                WiFi.disconnect(true);
                delay(200);
                WiFi.mode(WIFI_STA);
                WiFi.begin(WIFI_SSID, WIFI_PASS);
            }

